Using .groupby function

In [2]:
import pandas as pd

df = pd.read_csv("D:/Programming/Datasets/titanic.csv")
df = df.drop(columns=["Name", "Ticket", "Embarked", "Cabin" ])
df = df.dropna()
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare
0,0,1,0,3,male,22.0,1,0,7.2500
1,1,2,1,1,female,38.0,1,0,71.2833
2,2,3,1,3,female,26.0,0,0,7.9250
3,3,4,1,1,female,35.0,1,0,53.1000
4,4,5,0,3,male,35.0,0,0,8.0500

In [4]:
#grouping passengers by gender

df.groupby("Sex")

In [5]:
#Using an aggregate function

df.groupby("Sex").sum()

        Unnamed: 0  PassengerId  Survived       Age  SibSp  Parch        Fare
Sex
female      114631       114892       197   7286.00    167    185  12419.1002
male        204943       205396        93  13919.17    199    123  12352.7828

In [6]:
groupdf = df.groupby("Sex")
groupdf.mean

MUltiple Aggregation using groupby()

In [7]:
df.groupby("Sex").agg({'PassengerId': 'count',
                       'Survived': 'sum',
                       'Age': 'mean'})

        PassengerId  Survived        Age
Sex
female          261       197  27.915709
male            453        93  30.726645

In [9]:
#Grouping by multiple columns

df.groupby(["Sex", "Pclass"]).mean()

               Unnamed: 0  PassengerId  Survived        Age     SibSp  \
Sex    Pclass
female 1       476.582278   477.582278  0.962025  34.531646  0.556962
       2       424.382353   425.382353  0.911765  27.757353  0.455882
       3       402.928571   403.928571  0.448980  21.892857  0.806122
       ?       539.750000   540.750000  0.937500  32.812500  0.812500
male   1       441.147368   442.147368  0.368421  41.025474  0.378947
       2       444.180851   445.180851  0.148936  30.982234  0.372340
       3       456.131687   457.131687  0.152263  26.437942  0.506173
       ?       497.190476   498.190476  0.333333  32.619048  0.238095

                  Parch        Fare
Sex    Pclass
female 1       0.531646  106.635075
       2       0.573529   21.457782
       3       0.908163   15.714797
       ?       0.937500   62.234375
male   1       0.326316   72.377325
       2       0.244681   21.309309
       3       0.263374   12.285080
       ?       0.238095   23.266067

Selecting information from grouped objects

In [10]:
df.groupby(["Sex", "Pclass"])["Survived"].mean()

Sex     Pclass
female  1         0.962025
        2         0.911765
        3         0.448980
        ?         0.937500
male    1         0.368421
        2         0.148936
        3         0.152263
        ?         0.333333
Name: Survived, dtype: float64

In [11]:
#The above example sliced by index

grouped = df.groupby(["Sex", "Pclass"])["Survived"].mean()
grouped["female"]

Pclass
1    0.962025
2    0.911765
3    0.448980
?    0.937500
Name: Survived, dtype: float64

In [12]:
# Using string index label
grouped['female']['1']

0.9620253164556962

In [13]:
# Same result as python 0 index
grouped['female'][0]

0.9620253164556962